package urok9;

public class Practicum {

    /**
     * Попросите пользователя ввести три целых числа.
     * Найти из них минимальное и вывести на экран.
     */
    public static void minNum() {

    }

    /**
     * Попросите пользователя ввести слово в консоль.
     * Проверить, есть ли в слове повторяющиеся буквы.
     */
    public static void repeatedLetters() {

    }

    /**
     * Попросите пользователя ввести слово.
     * Проверить, является ли слово палиндромом.
     */
    public static void palindrome() {

    }

    /**
     * Попросите пользователя ввести несколько целых чисел (разных).
     * Найти и вывести на экран сумму чисел, находящихся между минимальным и максимальным числом.
     * Минимальное и максимальное число в сумму не включать.
     */
    public static void betweenMinMax() {

    }

    /**
     * Попросите пользователя ввести несколько чисел в консоль.
     * Отсортировать их в порядке возрастания.
     */
    public static void sort() {

    }

    public static void main(String[] args) {

        // Все результаты выводить полными предложениями, используя форматированный вывод.
        // Например: System.out.printf("Минимальное число %d \n", num);

        minNum();

        System.out.println("----------");

        repeatedLetters();

        System.out.println("----------");

        palindrome();

        System.out.println("----------");

        betweenMinMax();

        System.out.println("----------");

        sort();

    }
}
