package lesson10;

import java.util.Scanner;

public class Homework {

    /*
    Написать конвертер для температуры (C -> F, F -> C) и веса (кг -> г, г -> кг).
    Всю логику необходимо разделить на методы самостоятельно.

    Пример работы программы:

    Что вы хотите конвертировать? (температура/вес):
    вес
    Какой перевод хотите сделать (г -> кг, кг -> г):
    г -> кг
    Введите значение:
    1200
    Результат: 1,2.
    */

    static Scanner sc = new Scanner(System.in); // Использовать этот сканер

}
