package lesson10;

import java.util.Scanner;

public class Practicum {

    /*
    Написать простой консольный калькулятор для двух целых чисел.
    Метод int getNum() - должен считывать с консоли целое число и возвращать его.
    Метод char getOperation() - должен считывать с консоли какое-то значение и возвращать символ с операцией (+, -, * или /)
    Метод int calc(int num1, int num2, char operation) - должен выполнять над числами num1 и num2 арифметическую операцию, заданную operation.
    Метод main() - должен считывать 2 числа (с помощью getInt()), считать операцию (с помощью getOperation(), передать все методу calc() и вывести на экран результат.

    Пример работы программы:

    Введите число:
    5
    Введите число:
    10
    Введите операцию:
    +
    Результат: 15.
    */

    static Scanner sc = new Scanner(System.in); // Использовать этот сканер

}
