package lesson12;

public class Homework {
    /*
    Cоздать класс кондитерской, в которой можно приготовить два вида кондитерских изделий:
    пирог с вареньем и печенье с шоколадом.
    Ингридиенты для пирога:
        мука - 200 г
        сахар - 130 г
        яйца - 2 шт
        масло - 200 г
        варенье - 150 г
     Ингридиенты для печенья:
        мука - 240 г
        сахар - 180 г
        яйца - 1 шт
        масло - 125 г
        шоколад 100 г
      В случае, если ингридиентов для пирога или печенья не хватает, необходимо вывести соответстуюшее сообщение,
      какого ингридиента не хватает. Когда пирог или печенье готовы - сообщить об этом на экран.
      Кроме того, должна быть возможность посмотреть, какие ингридиеты и в каком количестве есть в кондитерской,
      и при необходимости(не хватает, кончились) доставить необходимые ингридиенты (в любом количестве).
      Первоначальное количество ингридиентов в кондитерской - на ваше усмотрение.
     */
}
