package lesson05;

public class Homework {

    /**
     * Вывести на экран числа от 6 до 1, используя for и while операторы.
     */
    public static void sixToOne() {
        // Здесь должен быть код программы
    }

    /**
     * Вывести на экран нечетные числа, начиная с 1, используя for и while операторы.
     * Не выводить числа, идущие после числа 15.
     */
    public static void oddNumbers() {
        // Здесь должен быть код программы
    }

    /**
     * Вывести на экран четные числа от 2 до 20, используя for и while операторы.
     * Пропустите число 14.
     */
    public static void evenNumbers() {
        // Здесь должен быть код программы
    }

    /**
     * Вывести на экран такую последовательность чисел: 1 2 4 8 16 32 64 128 256 512.
     */
    public static void row() {
        // Здесь должен быть код программы
    }

    /**
     * Найти сумму чисел в интервале от 1 до 30, которые делятся на 5 или на 7.
     */
    public static void sum() {
        // Здесь должен быть код программы
    }

    public static void main(String[] args) {

        sixToOne(); // 6 5 4 3 2 1

        System.out.println("----------");

        oddNumbers(); // 1 3 5 7 9 11 13 15

        System.out.println("----------");

        evenNumbers();  // 2 4 6 8 10 12 16 18 20

        System.out.println("----------");

        row();  // 1 2 4 8 16 32 64 128 256 512

        System.out.println("----------");

        sum(); // 175
    }
}